GitConverter/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Документ для регистрации заявок на отгул, отпуск, больничный, жалоб и пожеланий</comment>
  <registerRecords>InformationRegister.СостоянияВерсии</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <comment>Физическое лицо, подающее заявку</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <comment>Тип заявки (отгул, отпуск, больничный, жалобы/пожелания)</comment>
    <type>
      <types>CatalogRef.ТипыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала периода для отгула, отпуска, больничного</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания периода для отгула, отпуска, больничного</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <comment>Причина или описание заявки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус заявки (Открыта, Одобрена, Отказано)</comment>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработчика</name>
    <comment>Комментарий администратора при обработке заявки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата и время обработки заявки администратором</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

GitConverter/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <comment>Перечисление статусов заявок</comment>
  <enumValues>
    <name>Открыта</name>
    <comment>Заявка подана и ожидает рассмотрения</comment>
  </enumValues>
  <enumValues>
    <name>Одобрена</name>
    <comment>Заявка одобрена администратором</comment>
  </enumValues>
  <enumValues>
    <name>Отказано</name>
    <comment>В заявке отказано администратором</comment>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Documents/Заявка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если создаем новую заявку, устанавливаем значения по умолчанию
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Статус = Перечисления.СтатусыЗаявок.Открыта;
	КонецЕсли;
	
	// Управление видимостью группы периода
	УправлениеВидимостьюПолейПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаявкиПриИзменении(Элемент)
	
	УправлениеВидимостьюПолейПериода();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюПолейПериода()
	
	// Проверяем, требует ли выбранный тип заявки указания периода
	ТребуетПериод = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ТипЗаявки) Тогда
		ТребуетПериод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипЗаявки, "ТребуетПериод");
	КонецЕсли;
	
	// Управляем видимостью полей периода
	Элементы.ГруппаПериод.Видимость = ТребуетПериод;
	
	// Если период не требуется, очищаем поля
	Если НЕ ТребуетПериод Тогда
		Объект.ДатаНачала = '00010101';
		Объект.ДатаОкончания = '00010101';
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	// Дополнительные действия при выборе физического лица можно добавить здесь
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	
	// Проверяем заполнение обязательных полей
	Если НЕ ПроверитьЗаполнениеОбязательныхПолей() Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем корректность периода
	Если НЕ ПроверитьКорректностьПериода() Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем документ
	Если ЗаписатьДокумент() Тогда
		ПоказатьПредупреждение(, "Заявка успешно отправлена!");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеОбязательныхПолей()
	
	Если НЕ ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать физическое лицо!");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипЗаявки) Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать тип заявки!");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Причина) Тогда
		ПоказатьПредупреждение(, "Необходимо указать причину!");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьКорректностьПериода()
	
	// Если группа периода видима, проверяем заполнение дат
	Если Элементы.ГруппаПериод.Видимость Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			ПоказатьПредупреждение(, "Необходимо указать дату начала!");
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			ПоказатьПредупреждение(, "Необходимо указать дату окончания!");
			Возврат Ложь;
		КонецЕсли;
		
		Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
			ПоказатьПредупреждение(, "Дата начала не может быть больше даты окончания!");
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗаписатьДокумент()
	
	Попытка
		Объект.Записать();
		Возврат Истина;
	Исключение
		ПоказатьПредупреждение(, "Ошибка при записи документа: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
